<a href="https://colab.research.google.com/github/tejalal/pandas-tutorial/blob/master/Pandas_cheatsheet.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Basic functions

In [ ]:
import datetime
import seaborn as sns
%matplotlib inline
import pandas as pd

# load google drive
from google.colab import drive
drive.mount('/content/drive')
data = pd.read_csv('/content/drive/MyDrive/Dataset/IRIS.csv', delimiter='\t', ) 
# skiprows=[0], header=None, names=names
data.head()

In [1]:
import pandas as pd
print('Pandas Version:', pd.__version__)
 
# Series
values = ['India', 'Australia', 'USA', 'China']
countries = pd.Series(values)
week = pd.Series([10,20,30,40,50,50,60,70])
 
# DataFrame
data = pd.read_csv("IRIS.csv") # delimiter='\t', index_col=False, names = names(list)

data.describe()
data.describe(include='all')
data.describe(include=['object'])
data['sepal-length'].describe()
data['sepal-length'].tail(4)
data[['sepal-length', 'sepal-width']][10:15]

data.size #total number of entries
data.ndim
data.head(5)
data.tail(5)
data.shape
data.values # print all values
data.nunique()
labs['LabName'].value_counts()


data.sample(n=5) # random samples

data.sum()
data.mean()
data['sepal-length'].mean()
data['sepal-length'].std()
data.count() # no. of non-null observation in each column
data['class'].count() # class-wise count
data.median()
data['sepal-length'].abs()
data['sepal-length'].min()
data['sepal-length'].max()
data.cumsum()
data.cumprod() # works only with numerical values
data['sepal-length'].cumprod()

data.replace(-999,np.nan) # Replacing negagtive numbers with NaN

# Sorting
data[:5]['sepal-length'].sort_values()
data[:5].sort_values(by='sepal-length')
data[:5].sort_values(by='sepal-length', ascending = False)
data[:5]['sepal-length'].sort_values(ascending = False)
data[:5]['sepal-length'].sort_values(kind='heapsort') # mergesort, heapsort and quicksort.

Pandas Version: 1.1.5

## Groupby

In [ ]:
data.groupby('class').size() # class-wise count
data.groupby(['class','sepal-length']).groups
data.groupby('class').mean()

# Iterating through Groups
grouped = data.groupby('class')
for cls,values in grouped:
    print(cls)
    print(values)

    # Select a Group

grouped = data.groupby('class')
grouped.get_group('Iris-setosa')

patients.groupby('PatientRace').size()

# Admission ID wise details
admission.groupby('AdmissionID').count()

## Aggregations
An aggregated function returns a single aggregated value for each group.
Once the group by object is created, several aggregation operations can be performed on the grouped data.

In [2]:
grouped = data.groupby('class')
grouped['sepal-length'].agg(np.mean)

# Mutiple aggregate functions at once
grouped = data.groupby('class')
grouped['sepal-length'].agg([np.sum, np.mean, np.std])

## Working with Text data

- upper()
- lower()
- title()
- len()
- isnumeric()
- strip()
- isdigit()
- isalpha()
- isupper()
- islowe()
- swapcase()
- count(value)
- find(value)
- findall(value)
- startswith()
- endswith()
- split(seprator)
- replace(value1,value2)
- cat(seperator)
- repeat(n)
- contains(value)
- get_dummies()

In [ ]:
countries = pd.Series(['India', 'australia', ' USA', 'China'])
countries = countries.str
print(countries)

countries.count('U')
countries.find('USA') 
countries.findall('a') 
countries.cat(sep='$') 
countries.contains('aus')

## Working with options

In [ ]:
print(pd.get_option("display.max_columns"))
print(pd.get_option("display.max_rows"))

pd.set_option("display.max_rows",100)
pd.set_option("display.max_columns",100)

print(pd.get_option("display.max_columns"))

pd.reset_option("display.max_rows")
print(pd.get_option("display.max_rows"))

#print(pd.describe_option("display.max_rows"))

## Plotting

In [ ]:
import matplotlib.pyplot as plt
%matplotlib inline
import numpy as np

#data.plot()
data.plot(kind='bar',figsize=(10,10)) # bar chart

# histogram 
data.hist(edgecolor='black', linewidth=1.2)
fig=plt.gcf()
fig.set_size_inches(12,6)

In [ ]:
#male_female = patients.groupby('PatientGender').size()
sns.countplot(x='PatientGender',data=patients) # gender wise plot
# Patints distribution according to the marital status
sns.countplot(x='PatientMaritalStatus',data=patients)

# patients age distribution
sns.histplot(patients['AgeNew']) # histogram
# plot the #days patient histogram
sns.histplot(df['diff']) # days diffrence (startday-endday)

# Draw normal curve
ax = df['diff'].plot.kde()

# Year wise lab prescribed
df3 = pd.to_datetime(labs['LabDateTime'])
sns.histplot(df3)

## Select/set specific values

- df.loc[] and df.iloc[] to select only rows, only column or both
- df.at[] and df.iat[] to access a single value by row and column
- First index selects row, second select column

In [52]:
import pandas as pd
info = [['abc',5,3,4],
        ['def',5,6,7],
        ['ghi',8,9,10],
        ['jkl',11,12,13],
        ]
names = ['name', 'age', 'min', 'max']
df  = pd.DataFrame(info, columns = names)
df

  name  age  min  max
0  abc    5    3    4
1  def    5    6    7
2  ghi    8    9   10
3  jkl   11   12   13

In [53]:
import pandas as pd
info2 = [['abc',5,3,4],
        ['ef',5,6,7],
        ['ghi',8,9,10],
        ['kl',11,12,13],
        ]
names = ['name', 'sal', 'min_sal', 'max_sal']
df2  = pd.DataFrame(info2, columns = names)
df2

  name  sal  min_sal  max_sal
0  abc    5        3        4
1   ef    5        6        7
2  ghi    8        9       10
3   kl   11       12       13

In [26]:
# get value
df.at[3,'min'] # 12, 'min' column, third row 
df.iat[3,2] # 12, 'min' column, third row 

# Set value
df.at[2,'min'] = 200 # Set 200 at 'min' column, second row 
df.iat[3,2] = 100 # set 100 at 'min' column, third row 
df.at[df['age']==5, 'name'] = 'kkkkkk' # all places where age==5

# get value
df.loc[df['age']>5] # all rows where age>5
df.loc[df['age']>5, 'name'] # only name where age>5
df.loc[df['age']>5, 'name':'min'] # all columns between where age>5

# set value
df.loc[df['age']==5, 'name'] = 'INDIA' # all places where age==5

df.iloc[2:4] # selected rows
df.iloc[:, [0,1,2]] # all rows, selected column

    name  age  min
0  INDIA    5    3
1  INDIA    5    6
2    ghi    8    9
3    jkl   11   12

In [ ]:
# select data for final training and testing for PrimaryDiagnosisCode starting with below code
diabetes1 = original2[(original2['PrimaryDiagnosisCode'].str.startswith('E08')) | 
                      (original2['PrimaryDiagnosisCode'].str.startswith('E09')) |
                      (original2['PrimaryDiagnosisCode'].str.startswith('E10')) |
                      (original2['PrimaryDiagnosisCode'].str.startswith('E11'))
                       ]
codes = diabetes1['PrimaryDiagnosisCode'].unique()
final_data = original2.loc[original2['PrimaryDiagnosisCode'].isin(codes)]

In [ ]:
# conditional value set
c1 = (df.PatientGender==gender_m) & (df.LabName==name_m) & (df.LabValue>=minValue_m) & (df.LabValue<=maxValue_m)
df.loc[c1, 'LabValue'] = 1

# replace all other valules to 0
df.loc[(df['LabValue']!=1.0), 'LabValue'] = 0

## Query

In [54]:
df.query('age>5')

  name  age  min  max
2  ghi    8    9   10
3  jkl   11   12   13

## Merge tables

In [55]:
# left
xx = pd.merge(df, df2, on='name', how='left')
xx

  name  age  min  max  sal  min_sal  max_sal
0  abc    5    3    4  5.0      3.0      4.0
1  def    5    6    7  NaN      NaN      NaN
2  ghi    8    9   10  8.0      9.0     10.0
3  jkl   11   12   13  NaN      NaN      NaN

In [56]:
# right
xx = pd.merge(df, df2, on='name', how='right')
xx

  name  age  min   max  sal  min_sal  max_sal
0  abc  5.0  3.0   4.0    5        3        4
1   ef  NaN  NaN   NaN    5        6        7
2  ghi  8.0  9.0  10.0    8        9       10
3   kl  NaN  NaN   NaN   11       12       13

In [57]:
# inner
xx = pd.merge(df, df2, on='name', how='inner')
xx

  name  age  min  max  sal  min_sal  max_sal
0  abc    5    3    4    5        3        4
1  ghi    8    9   10    8        9       10

In [58]:
# outer
xx = pd.merge(df, df2, on='name', how='outer')
xx

  name   age   min   max   sal  min_sal  max_sal
0  abc   5.0   3.0   4.0   5.0      3.0      4.0
1  def   5.0   6.0   7.0   NaN      NaN      NaN
2  ghi   8.0   9.0  10.0   8.0      9.0     10.0
3  jkl  11.0  12.0  13.0   NaN      NaN      NaN
4   ef   NaN   NaN   NaN   5.0      6.0      7.0
5   kl   NaN   NaN   NaN  11.0     12.0     13.0

In [ ]:
# left
xx = pd.merge(df, df2, on='name', how='left')
xx

## Missing values, Isnull and Drop columns

In [65]:
xx.drop(['min_sal', 'max_sal'], axis=1, inplace=True)

#Check for nan vlaues
data.isna().sum()

# missing values
data.isnull().sum()

print("Unique patients", len(patients['PatientID'].unique()))

In [66]:
xx

  name   age   min   max   sal
0  abc   5.0   3.0   4.0   5.0
1  def   5.0   6.0   7.0   NaN
2  ghi   8.0   9.0  10.0   8.0
3  jkl  11.0  12.0  13.0   NaN
4   ef   NaN   NaN   NaN   5.0
5   kl   NaN   NaN   NaN  11.0

## One hot

In [ ]:
one_hot_gender = pd.get_dummies(enccode_df['PatientGender'], prefix='gender')
orig=orig.join(one_hot_gender)
orig = orig.drop(['PatientGender', 'PatientRace'], axis = 1)

## Others

In [ ]:
# Single patient data in the Lab
code = labs[labs.PatientID.str.startswith('915BC24E-8C44-4D33-A386-CEA965B83F32')] 
code.nunique()

uniquelab = labname_value['LabName'].unique()
# sort the lab name values by name
uniquelab = sorted(uniquelab)

# Unique admission ID's
admission['AdmissionID'].unique()

In [ ]:
# Age calculation, function to find and add the Age to the merged dataframe
def findAge(dob):
  date_time_obj = datetime.datetime.strptime(dob, '%Y-%m-%d %H:%M:%S.%f')
  birth_date = date_time_obj.date()
  end_date = datetime.date(2021, 1, 1)
  time_difference = end_date - birth_date
  age = time_difference.days
  #print("days",age)
  #print(int(age/365.2425))
  return int(age/365.2425)

ages=[]
for value in range(len(patients['PatientDateOfBirth'])):
    datecol = patients['PatientDateOfBirth'][value]
    ages.append(findAge(datecol))    

# Add age column after DOB
patients.insert(3, "PatientAge", ages, True) 
patients.head(2)

In [ ]:
# The number of days a patient was admitted for
df = pd.DataFrame(columns=["one", "two"])
df.one=pd.to_datetime(admission['AdmissionStartDate'])
df.two=pd.to_datetime(admission['AdmissionEndDate'])
difference = (df.two - df.one)
df['diff'] = difference.dt.days
df['diff'].describe()

In [ ]:
# Correlation
correlation = labs['AdmissionID'].corr(labs['AdmissionID'])
correlation

labs.corr()

In [ ]:
# Unique diagnosis codes
codes=admissionDiagnoses['PrimaryDiagnosisCode'].unique().size
print('Unique Diagnosis codes', codes)

# Get unique record count
admissionDiagnoses.nunique(axis=0)

# Get Diabetes patient details
# E08, E09, E10, E11, the codes from E08-E09 are for diabetes
code = admissionDiagnoses[admissionDiagnoses.PrimaryDiagnosisCode.str.startswith('E08')] 
code.head(10)

# Get patients with diabetes diagnosis
diabetescode = ['E08', 'E09', 'E10', 'E11']
diabetes = admissionDiagnoses[admissionDiagnoses.PrimaryDiagnosisDescription.str.startswith('Diabetes')]
#len(pulmonarydisdf)
diabetes.head(10)
len(diabetes)